---
kind: method
id: M:Autodesk.Revit.DB.FailureMessage.GetFailureDefinitionId
source: html/3e83bc2c-7f43-2e97-3df7-519bb07e7695.htm
---
# Autodesk.Revit.DB.FailureMessage.GetFailureDefinitionId Method

Retrieves the id of the failure definition for the failure.

## Syntax (C#)
```csharp
public FailureDefinitionId GetFailureDefinitionId()
```

## Returns
The id of the FailureDefinition for the failure.